Revit 2027 API
ExportLayerInfo.AddCutLayerModifier Method
 Adds a cut layer modifier to the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddCutLayerModifier(
	LayerModifier layerModifier
)
Public Sub AddCutLayerModifier (
	layerModifier As LayerModifier
)
public:
void AddCutLayerModifier(
	LayerModifier^ layerModifier
)
member AddCutLayerModifier :
        layerModifier : LayerModifier -> unit
Parameters
layerModifier LayerModifier
 The cut layer modifier.
Exceptions
Exception | Condition
ArgumentException |  The separator string contains one or more prohibited characters. -or- The modifier type already exists in the cut layer info.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace